import { lib, game, ui, get, ai, _status } from "noname";
const translate = {
  // ... 从旧文件末尾复制
  //get.characterSurname("")
  //108将
  sh_songqing: "宋清",
  sh_lili: "李立",
  sh_xueyong: "薛永",
  sh_guosheng: "郭盛",
  sh_lvfang: "吕方",
  sh_zhugui: "朱贵",
  sh_chenda: "陈达",
  sh_dengfei: "邓飞",
  sh_zhoutong: "周通",
  sh_muchun: "穆春",
  sh_oupeng: "欧鹏",
  sh_duxing: "杜兴",
  sh_sunerniang: "孙二娘",
  sh_husanniang: "扈三娘",
  sh_baisheng: "白胜",
  sh_yangchun: "杨春",
  sh_yuehe: "乐和",
  sh_malin: "马麟",
  sh_andaoquan: "安道全",
  sh_yubaosi: "郁保四",
  sh_baoxu: "鲍旭",
  sh_xiaorang: "萧让",
  sh_peixuan: "裴宣",
  sh_tanglong: "汤隆",
  sh_duanjingzhu: "段景住",
  sh_mengkang: "孟康",
  sh_jiangjing: "蒋敬",
  sh_huangfuduan: "皇甫端",
  sh_zhuwu: "朱武",
  sh_shiqian: "时迁",
  sh_wangdingliu: "王定六",
  sh_huangxin: "黄信",
  sh_sunli: "孙立",
  sh_haosiwen: "郝思文",
  sh_zhufu: "朱富",
  sh_houjian: "侯健",
  sh_fanrui: "樊瑞",
  sh_shantinggui: "单廷珪",
  sh_weidingguo: "魏定国",
  sh_yanshun: "燕顺",
  sh_lingzhen: "凌振",
  sh_yanglin: "杨林",
  sh_pengqi: "彭玘",
  sh_hantao: "韩滔",
  sh_caifu: "蔡福",
  sh_caiqing: "蔡庆",
  sh_kongming: "孔明",
  sh_kongliang: "孔亮",
  sh_liutang: "刘唐",
  sh_wuyong: "吴用",
  sh_caozheng: "曹正",
  sh_huyanzhuo: "呼延灼",
  sh_songjiang: "宋江",
  sh_xuning: "徐宁",
  sh_dongping: "董平",
  sh_zhengtianshou: "郑天寿",
  sh_daizong: "戴宗",
  sh_muhong: "穆弘",
  sh_taozongwang: "陶宗旺",
  sh_zhangheng: "张横",
  sh_wangying: "王英",
  sh_likui: "李逵",
  sh_zouyuan: "邹渊",
  sh_zourun: "邹润",
  sh_zhangqing: "张清",
  sh_tongwei: "童威",
  sh_tongmeng: "童猛",
  sh_jiaoting: "焦挺",
  sh_suochao: "索超",
  sh_ruanxiaoer: "阮小二",
  sh_ruanxiaowu: "阮小五",
  sh_shien: "施恩",
  sh_zhangqing2: "张青",
  sh_shiyong: "石勇",
  sh_yangzhi: "杨志",
  sh_zhutong: "朱仝",
  sh_sunxin: "孙新",
  sh_gudasao: "顾大嫂",
  sh_yangxiong: "杨雄",
  sh_shixiu: "石秀",
  sh_liyun: "李云",
  sh_leiheng: "雷横",
  sh_jindajian: "金大坚",
  sh_lijun: "李俊",
  sh_xuanzan: "宣赞",
  sh_xiezhen: "解珍",
  sh_xiebao: "解宝",
  sh_chaijin: "柴进",
  sh_zhangshun: "张顺",
  sh_ruanxiaoqi: "阮小七",
  sh_liying: "李应",
  sh_qinming: "秦明",
  sh_yanqing: "燕青",
  sh_shijin: "史进",
  sh_luzhishen: "鲁智深",
  sh_huarong: "花荣",
  sh_gongwang: "龚旺",
  sh_dingdesun: "丁得孙",
  sh_gongsunsheng: "公孙胜",
  sh_guansheng: "关胜",
  sh_lizhong: "李忠",
  //其他
  sh_wanglun: "王伦",
  sh_chaogai: "晁盖",
  sh_yanpoxi: "阎婆惜",
  sh_panqiaoyun: "潘巧云",
  sh_zhuzhuzhu: "祝龙祝虎祝彪",
  sh_zengzengzengzengzeng: "曾涂曾密曾索曾魁曾升",
  sh_caijing: "蔡京",
  sh_tongguan: "童贯",
  sh_gaoqiu: "高俅",
  sh_yangjian: "杨戬",
  sh_zhaoji: "赵佶",
  sh_lizhu: "李助",
  sh_wuyanguang: "兀颜光",
  sh_yelvhui: "耶律辉",
  sh_dalibo: "答里孛",
  sh_ximenqing: "西门庆",
  sh_bianxiang: "卞祥",
  sh_koumie: "寇烕",
  sh_hongxin: "洪信",
  sh_baodaoyi: "包道乙",
  sh_shibao: "石宝",
  sh_qiaodaoqing: "乔道清",
  sh_tianhu: "田虎",
  sh_qiuqiongying: "仇琼英",
  sh_jiutianxuannv: "九天玄女",
  sh_duansanniang: "段三娘",
  sh_lishishi: "李师师",
  sh_pangwanchun: "庞万春",

  //模板将
  sh_muban: "X血摸Y",
  //sort
  oldtouling: "梁山先代头领",
  zongtouling: "总兵都头领",
  junshi: "掌管机密军师",
  wuhu: "马军五虎将",
  piaoqi: "马军八骠骑兼先锋使",
  canzan: "一同参赞军务头领",
  xiaobiaojiang: "马军小彪将",
  qianliang: "掌管钱粮头领",
  bujuntou: "步军头领",
  bujunjiang: "步军将校",
  sizhaishuijun: "四寨水军头领",
  sidian: "四店打听声息，迎接来宾头领",
  zongtanshengxitouling: "总探听声息头领",
  zoubao: "军中走报机密步军头领",
  maxiaojiang: "守护中军马军骁将",
  buxiaojiang: "守护中军步军骁将",
  guizi: "专掌行刑刽子",
  sanjunma: "专掌三军内探事马军头领",
  jianzao: "掌管监造诸事头领",
  other: "其他角色",
  fourJianChens: "四大奸臣",
  zhujiazhuang: "祝家庄",
  zengtoushi: "曾头市",
  huaixiwangqing: "淮西王庆",
  hebeitianhu: "河北田虎",
  liaoguo: "辽国",
  jiangnanfangla: "江南方腊",
  //tag
  visible_shjinghun: "鲸魂",
  //equip
  shfenghuo: "风火炮",
  shfenghuo_info:
    "出牌阶段开始时，你可弃置至少两张类型不同的手牌并对一名攻击范围内的角色造成X点火焰伤害（X为本次因此弃置的牌数-1）。",
  shjinlun: "金轮炮",
  shjinlun_info:
    "出牌阶段，你可将一张红色基本牌当火【杀】使用并选择一项：摸一张牌；令此【杀】不计入使用次数。",
  shzimu: "子母炮",
  shzimu_info: "锁定技，你使用【杀】可额外指定一个目标。",
  danshutiequan: "丹书铁券",
  danshutiequan_info:
    "锁定技。①若你的手牌数不少于手牌上限，你的摸牌阶段改为与零至三名装备区有牌的其他角色各视为使用一张【树上开花】；反之你额外摸两张牌。②你的手牌上限等于一号位的体力上限。③你受到不小于你当前体力值的伤害时，你可弃置装备区的此牌，防止此伤害。",
  shjinjiashenren: "金甲神人",
  shjinjiashenren_info:
    "锁定技，装备此牌时，你的体力上限+1且势力视为神；你视为装备着随机武器牌（此牌进入装备区时确定）。此牌离开装备区时销毁。",
  //skill
  shqinhui: "清慧",
  shqinhui_info: `出牌阶段开始时，你可弃置任意张牌。若如此做，当前回合结束时，若${get.poptip("rule_centralDisCards")}牌的花色数等于你以此法弃牌数，你摸三张牌。`,
  shkangge: "亢歌",
  shkangge_info:
    "你使用的牌结算完成后，你可令一名手牌多于你的角色选择一项：使用一张同花色牌并获得〖亢歌〗至本轮结束；交给你一张牌，然后你本回合不能再对其发动〖亢歌〗。",
  shxingbin: "兴宾",
  shxingbin_info:
    "出牌阶段限一次，你可展示所有手牌并令至多三名其他角色依次选择一项：获得一张展示牌；令你摸一张牌。然后你可令所有选择令你摸牌的角色回复1点体力。上述流程结束后，你弃置手牌中所有展示的牌，若你没有需弃置的牌，你摸两张牌。",
  shfengyuan: "逢缘",
  shfengyuan_info:
    "其他角色主要阶段开始时，若其手牌数小于体力值，你可交给其X张牌，若如此做，该角色可摸两张牌并将一张类型与你交给其的牌均不同的牌交给你（X为你本回合发动〖逢缘〗的次数）。",
  shboshi: "搏矢",
  shboshi_info:
    "每回合限一次，当其他角色使用牌指定你为唯一目标后，你可获得此牌并令之对你无效。若如此做，本回合被使用的下一张牌额外结算一次。",
  shzhenwei: "镇威",
  shzhenwei_info:
    "你攻击范围内的角色回合开始时，你可令其选择一项：交给你一张手牌；令你移动其场上一张牌；令你视为对其使用一张刺【杀】。背水：对你造成1点伤害。",
  shduogui: "夺闺",
  shduogui_info:
    "出牌阶段，你可将手牌中一张装备牌置于其他角色的对应装备栏（可替换原装备）并令其选择一项：交给你两张手牌；失去1点体力并令〖夺闺〗此回合无效。",
  shdaozhui: "盗骓",
  shdaozhui_info:
    "一名角色受到伤害后，你可获得其装备区一张牌并令其摸一张牌，然后若你在其攻击范围内，其可对你使用一张【杀】。",
  shyuejian: "越涧",
  shyuejian_info:
    "出牌阶段限一次，你可与一名体力值不小于你的角色拼点，若你赢，你弃置其一张牌，并令〖越涧〗视为未发动过；若你没赢，其可对你使用一张【杀】。",
  shyaomeng: "邀盟",
  shyaomeng_info:
    "你的上家/下家于回合内使用的前两张牌结算完成后，你可将这些牌交给你的下家/上家，若你交出的牌于获得者的手牌区包含【杀】或【酒】，你摸一张牌。",
  shdongzhu: "洞烛",
  shdongzhu_info:
    "锁定技，牌堆顶两张牌始终对你可见。每轮限一次，一名角色的判定阶段开始时，你可用至多两张手牌等量替换牌堆顶两张牌，然后将这些牌按任意顺序放回牌堆顶。",
  shzhanji: "战戟",
  shzhanji_info:
    "出牌阶段开始时，你可摸三张牌并展示所有手牌，弃置手牌中已有的花色各一张。若如此做，直到此阶段结束，你可多出4-X张【杀】且使用【杀】可额外指定X名目标（X为你以此法弃置牌数）。若X不小于3，此阶段你视为拥有技能〖无双〗；不小于4，本局游戏你发动〖战戟〗多摸一张牌（至多摸五张）。",
  shlingwu: "伶武",
  shlingwu_info:
    "【杀】或【决斗】造成伤害时，若你为伤害来源，你可令你攻击范围内所有角色依次选择一项：交给你一张牌；令你弃置一张手牌。若如此做，此伤害值改为你以此法弃置的手牌数量。",
  shsixing: "肆行",
  shsixing1: "肆行",
  shsixing2: "肆行",
  shsixing_info:
    "一级：一名场上有牌的其他角色判定阶段开始时，你可对其造成1点伤害，若如此做，当其本回合对你造成伤害后，其回复1点体力。二级：其他角色进入濒死状态时，你可获得其区域内任意张牌，若如此做，当其脱离濒死状态时，你需交给其等量张牌。",
  shyuxun: "欲熏",
  shyuxun_info:
    "锁定技，限定技，其他角色跳过阶段时，若其区域内牌数为全场唯一最多，你升级〖肆行〗并对其造成2点伤害。",
  shsheyan: "设宴",
  shsheyan_info: `出牌阶段限一次，你可令所有本回合失去过牌的角色依次选择一项：获得${get.poptip("rule_centralDisCards")}的一张基本牌；回复1点体力，然后弃置一张牌。`,
  shanxiang: "安乡",
  shanxiang_info: `出牌阶段结束时，你可视为使用一张${get.poptip("jiejia")}。若你因此指定了自己为目标，你下次摸牌阶段多摸两张牌。`,
  shpixian: "辟险",
  shpixian_info:
    "转换技，出牌阶段，你可和座次小于你的角色交换：①手牌；②装备；③座次。若你以此法交换座次或交换牌差不小于三，〖辟险〗失效至你进入濒死状态。",
  shpengshuai: "捧帅",
  shpengshuai_info:
    "准备阶段，你可展示任意张锦囊牌并选择等量名本轮未进行过回合的角色，这些角色下个回合的摸牌阶段摸牌数+2；出牌阶段使用【杀】次数上限+1；弃牌阶段手牌上限+3。",
  shxiongjian: "凶剑",
  shxiongjian_info:
    "锁定技，当你对一名角色造成伤害时，若伤害值不小于其体力值，此伤害+1。",
  shbaoshi: "暴弑",
  shbaoshi_info:
    "每回合限一次，当你造成/受到伤害后，你可弃置一张牌/摸一张牌，然后获得造成伤害的牌。",
  shweishu: "伪书",
  shweishu_info:
    "当一张锦囊牌指定唯一目标后，若使用者不为你，你可弃置一张同花色牌，然后声明一个与你所弃置的牌名称字数相等的基本牌或普通锦囊牌。若如此做，此牌随后按你所声明的牌结算。",
  shcangfeng: "藏锋",
  shcangfeng_info: "锁定技，你的黑色牌不计入手牌上限。",
  shdingpan: "定判",
  shdingpan_info:
    "出牌阶段限两次，你可横置一名手牌数不少于你的角色，对其造成1点伤害；或重置一名手牌数不多于你的角色，令其将手牌数调整至四。",
  shjianghun: "匠魂",
  shjianghun_info:
    "当你受到伤害后，你可将一张因〖冶兵〗移出游戏的牌置于牌堆顶，然后你回复1点体力或移动场上一张与之花色相同的装备牌。",
  shqiema: "窃马",
  shqiema_info:
    "出牌阶段限一次，你可将一名角色场上一张坐骑牌移动给另一名角色，角色声明完毕后，座次位于两者间的其余角色依次选择是否对两者其中之一使用一张无距离限制的【杀】。若均未选择是，你与获得坐骑的角色各摸一张牌。",
  shhuoqi: "祸起",
  shhuoqi_info: "锁定技，你的回合内，其他角色造成的伤害+1。",
  shjianjian: "监舰",
  shjianjian_info:
    "出牌阶段限一次，你可横置至多三名装备区有牌的其他角色，然后这些角色依次交给你一张牌。若如此做，你选择一项：弃置其中未以此法交给你装备牌的角色各一张牌；令以此法交给你红色牌的角色各摸一张牌。",
  shleiju: "累举",
  shleiju_info:
    "阶段开始前，你可选择一项：弃置一张牌，此阶段改为进行出牌阶段；摸两张牌，此阶段改为进行弃牌阶段。",
  shweibu: "微步",
  shweibu_info:
    "摸牌阶段开始时，你可放弃摸牌，若如此做，本轮你至其他角色的距离视为1。",
  shyafeng: "鸦风",
  shyafeng_info: `出牌阶段限一次，你可将一张黑色牌当【顺手牵羊】使用。若${get.poptip("rule_centralDisCards")}的牌花色均为♣，你发动〖鸦风〗无次数限制。`,
  shhuoshan: "霍闪",
  shhuoshan_info:
    "你可将一半数量（向上取整）的手牌当【闪】使用或打出。若你以此法使用【闪】且对应实体牌数不小于2，本轮其他角色计算与你距离+1。",
  shquexi: "却溪",
  shquexi_info:
    "当你使用牌时，若对应实体牌数量不小于你当前体力值，你可摸一张牌或重铸所有牌，然后回复1点体力。若等于体力值，则你额外摸一张牌。",
  shjingdi: "惊笛",
  shjingdi_info:
    "出牌阶段每种花色各限一次，若你手牌中仅包含/仅缺少一种花色，你可展示所有手牌并令此阶段进攻距离+1，然后摸一张牌/弃置一张牌。若如此做，你可视为使用一张不受次数限制的雷【杀】。",
  shjiepeng: "解烹",
  shjiepeng_info:
    "其他角色死亡时或于你的回合内濒死时，你可分配其装备区所有牌并明置之。",
  shjiayao: "戛肴",
  shjiayao_info:
    "锁定技，场上角色因〖解烹〗明置的红色/黑色手牌均视为濒死使用额外回复1点体力/主动使用额外失去1点体力的【酒】。",
  shpingyue: "平岳",
  shpingyue_info:
    "出牌阶段每项各限一次，你可将所有手牌分配给其他角色并摸三张牌，视为对这些角色使用一张无距离次数限制的雷【杀】/火【杀】/冰【杀】。若以此法使用的【杀】造成了伤害，此阶段〖平岳〗失效。",
  shxuanzhen: "旋阵",
  shxuanzhen_info:
    "出牌阶段，你可移动场上一张本回合未以此法移动过的装备牌。然后若你攻击范围内的角色数因此增加，你可视为使用一张【杀】；因此减少，你摸两张牌；均不满足，本回合〖旋阵〗失效。",
  shlingchen: "凌尘",
  shlingchen_info:
    "出牌阶段限一次，你可将武将牌：横置，视为使用【杀】；重置，视为使用【酒】；翻至背面，本轮使用基本牌额外结算一次且可多指定一个目标（目标需合法）。",
  shzhenjiu: "斟酒",
  shzhenjiu_info:
    "其他角色出牌阶段开始时，你可弃置一张牌，令其展示所有手牌并使用其中所有【酒】。若其未因此使用【酒】，你于本回合结束时与该角色交换手牌，然后本轮〖斟酒〗失效。",
  shfengchun: "丰醇",
  shfengchun_info:
    "出牌阶段限一次，你可将所有手牌当从牌堆底亮出牌的【五谷丰登】使用。此牌指定第一个目标后，你可令之对至多X名目标无效（X为此牌对应实体牌数）。",
  shcangren: "藏刃",
  shcangren_info:
    "当其他角色获得因【五谷丰登】亮出的仅一张牌后，若该牌为基本牌或普通锦囊牌，你可视为对其使用一张同名牌。若之未造成伤害，你卜算2。",
  shzhijing: "织旌",
  shzhijing_info: `每轮限一次，一名角色的回合结束时，你可令其获得${get.poptip("rule_centralDisCards")}任意张花色不同的牌。若如此做，该角色不能使用或打出这些花色的牌直到本轮结束。`,
  shmifeng: "密缝",
  shmifeng_info: `体力值为1的角色需要使用【闪】时，其可重铸一张牌，若${get.poptip("rule_centralDisCards")}牌的花色数因此增加，其视为使用之。`,
  shyaofa: "妖法",
  shyaofa_info:
    "其他角色成为【杀】的目标时，你可弃置一张牌并将其场上一张与之花色相同的牌移动给一名不为此【杀】目标的角色。若后者不为【杀】的使用者，则也成为此【杀】目标；否则，你摸三张牌并翻面。",
  shguahuo: "剐祸",
  shguahuo_info:
    "锁定技，当你进入濒死状态时，你须将所有手牌分配给其他角色，你仅能向因此获得牌的角色求桃。",
  shjianghuo: "绛火",
  shjianghuo_info:
    "出牌阶段限一次，你可视为对任意名横置角色使用一张【火攻】。且你每因此弃置一种花色的牌，你便摸三张牌。",
  shbingyin: "兵引",
  shbingyin_info:
    "当你受到伤害时，你可横置一名装备区有牌的角色，若该角色为你，防止此伤害。",
  shjinbing: "浸兵",
  shjinbing_info: `出牌阶段开始时，你可视为对装备区牌数为全场最多的一名其他角色使用一张${get.poptip("shuiyanqijunx")}。你因〖浸兵〗使用的【水淹七军】对一名角色造成伤害后，若其非当前回合角色，你可于受伤角色的下次出牌阶段开始时发动〖浸兵〗。`,
  shjierao: "劫扰",
  shjierao_info:
    "你使用【杀】指定目标后，你可获得其至多两张牌并展示之，然后交给其等量牌。若你展示了【杀】，你少交给其一张牌；【闪】，你多交给其一张牌。",
  shhongchong: "轰铳",
  shhongchong_info:
    "转换技，锁定技，准备阶段，若你未装备有①【风火炮】；②【金轮炮】；③【子母炮】，你从游戏外获得之并将之置入装备区。且这些牌离开你的装备区后移出游戏。",
  shfenghuo_skill: "风火炮",
  shfenghuo_skill_info:
    "出牌阶段开始时，你可弃置至少两张类型不同的手牌并对一名攻击范围内的角色造成X点火焰伤害（X为本次因此弃置的牌数-1）。",
  shjinlun_skill: "金轮炮",
  shjinlun_skill_info:
    "出牌阶段，你可将一张红色基本牌当火【杀】使用并选择一项：摸一张牌；令此【杀】不计入使用次数。",
  shzimu_skill: "子母炮",
  shdiangangqiang_skill: "浑铁点钢枪",
  shpodao_skill: "朴刀",
  shgoulianqiang_skill: "钩镰枪",
  shsaitangni_skill: "赛唐猊",
  shzimu_skill_info: "锁定技，你使用【杀】可额外指定一个目标。",
  danshutiequan_skill: "丹书铁券",
  danshutiequan_skill2: "丹书铁券",
  danshutiequan_skill_info:
    "锁定技。①若你的手牌数不少于手牌上限，你的摸牌阶段改为与零至三名装备区有牌的其他角色各视为使用一张【树上开花】；反之你额外摸两张牌。②你的手牌上限等于一号位的体力上限。③你受到不小于你当前体力值的伤害时，你可弃置装备区的此牌，防止此伤害。",
  shxuantianhunyuanjian_skill: "玄天混元剑",
  shxuantianhunyuanjian_skill2: "玄天混元剑",
  shxuantianhunyuanjian_skill_info:
    "转换技，阳：你的【杀】可当【过河拆桥】使用。阴：你的锦囊牌可当雷【杀】使用。你以此法使用牌时，“包道乙”摸一张牌。",
  shjinjiashenren_skill: "金甲神人",
  shjinjiashenren_skill_info:
    "锁定技，装备此牌时，你的体力上限+1且势力视为神；你视为装备着随机武器牌（此牌进入装备区时确定）。此牌离开装备区时销毁。",
  shyebing_faq: "梁山兵甲库",
  shyebing_faq_info:
    "<br>【朴刀】♠J×3<br>【浑铁点钢枪】♣A×1<br>【钩镰枪】♠9×2<br>【赛唐猊】<font color=#FF0000>♥</font>A×1<br>【丹书铁券】<font color=#FF0000>♦</font>K×1",
  shguiyin_faq: "丹书铁券",
  shguiyin_faq_info:
    "锁定技。①若你的手牌数不少于体力值，你的摸牌阶段改为与零至三名装备区有牌的其他角色各视为使用一张【树上开花】；反之你额外摸两张牌。②你的手牌上限等于一号位的体力上限。③你受到不小于你当前体力值的伤害时，你可弃置装备区的此牌，防止此伤害。",
  shchiyan: "驰烟",
  shchiyan_info: "锁定技，游戏开始时，你废除进攻坐骑栏并获得一个额外的武器栏。",
  shfuxing: "福星",
  shfuxing_info:
    "转换技，限定技，你可视为使用，阳：【杀】；阴：【酒】。然后重置〖求闲〗。",
  shshenbing: "神兵",
  shshenbing_info: `锁定技，你视为拥有${get.poptip("sanjian")}及所有攻击范围等于你当前体力值的武器技能。`,
  shtianmu: "天目",
  shtianmu_info:
    "锁定技，当你使用【杀】时，若你的体力值大于攻击范围，你摸一张牌；等于，此【杀】额外结算一次；小于，此【杀】不可被响应。",
  shlianzheng: "连征",
  shlianzheng_info:
    "转换技，出牌阶段限一次，你可：阳：视为使用一张【决斗】，然后于之结算完成后失去1点体力；阴：将X张手牌当【决斗】使用，然后于你因之造成伤害后摸两张牌（X为你本回合造成过的伤害值+1）。当你和体力值大于你的角色【决斗】胜利后，你重置本回合〖连征〗发动次数。",
  shguixing: "刽刑",
  shguixing_info:
    "出牌阶段限一次，你可对一名体力值小于你的其他角色造成2点伤害。若如此做，本回合该角色可交给你一张红色牌以视为使用【桃】，若交出的牌为基本牌，其再额外回复1点体力。",
  shwanzui: "挽罪",
  shwanzui_info:
    "每轮限一次，一名角色进入濒死状态时，你可令其摸两张牌/回复1点体力。若如此做，当前回合结束时，你须视为使用一张【桃园结义】/【五谷丰登】。",
  shqiuxian: "求闲",
  shqiuxian_info:
    "转换技，限定技，你可视为使用，阳：【闪】；阴：【桃】。然后重置〖福星〗。",
  shhuixiong: "彗凶",
  shhuixiong_info:
    "限定技，出牌阶段，你可先令一名手牌不少于你的角色弃置至多两张牌，然后你可再令一名手牌多于你的角色交给你至少两张牌，若均执行且二者手牌均不多于你，你对其中一名角色造成1点伤害。当你杀死一名角色后，若你〖彗凶〗已发动，你摸三张牌并重置〖彗凶〗。",
  shwunu: "误怒",
  shwunu_info:
    "当你成为【杀】的目标后，你可对此【杀】的使用者造成1点伤害。若如此做，此【杀】结算完成后，若之未对你造成伤害，其回复1点体力。",
  shzhengchou: "争仇",
  shzhengchou_info:
    "你可将一张【杀】当【借刀杀人】使用，且目标角色可视为使用【杀】来响应之。",
  shjinchong: "烬艟",
  shjinchong_info:
    "锁定技，你横置/重置武将牌后须将武将牌调整至背面向上/正面向上，然后摸三张牌/分配1点火焰伤害。",
  shhenglue: "横掠",
  shhenglue_info:
    "若你的武将牌横置/未横置，你可将一张红色手牌当无距离限制但仅可选择场上牌的【顺手牵羊】/目标须包括你但可额外指定一名其他角色的【铁索连环】使用。",
  shpiaopeng: "飘蓬",
  shpiaopeng_info:
    "每轮限一次，其他角色的出牌阶段，其可弃置一张牌令你横置或重置武将牌。",
  shqiongji: "穷计",
  shqiongji_info:
    "出牌阶段限一次，你可令一名其他角色弃置你与其共计两张手牌，然后若这两张牌颜色相同/不同，你视为使用一张可额外指定至多X名目标的【无中生有】/【过河拆桥】（X为你因此被弃置的牌数）。",
  shjiaozhi: "狡智",
  shjiaozhi_info:
    "其他角色使用牌指定你为目标后，若你没有手牌，你可观看牌堆顶三张牌并将这些牌分配给此牌任意名目标，然后此牌对这些目标无效。",
  shguanshi: "观势",
  shguanshi_info:
    "准备阶段，你可观看牌堆顶五张牌或一名其他角色的手牌，然后你可弃置其中任意张【杀】或将其中一张【杀】交给一名角色。",
  shkunbian: "鲲变",
  shkunbian_info:
    "一名角色成为【杀】的唯一目标后，若你至其距离1以内，你可令其摸两张牌并展示之，然后若此【杀】被抵消，其弃置所有因〖鲲变〗获得的手牌。",
  shtujie: "屠解",
  shtujie_info:
    "你使用【杀】指定目标后，你可弃置其至多三张牌，然后若此【杀】对其造成了伤害，其摸等量牌；其因此【杀】进入濒死，你分配以此法弃置的牌；其因此【杀】死亡，改为你摸牌。",
  shlianji: "连骑",
  shlianji_info:
    "准备阶段，你可依次执行至多两项：①令至多三名角色各使用一张牌；②移动场上任意张坐骑牌；③令任意名装备区有牌的角色进入连环状态。",
  shyubing: "御兵",
  shyubing_info:
    "横置角色受到非连环伤害时，你可选择一项：令任意名横置角色摸一张牌；重置其武将牌并防止此伤害；摸三张牌，然后重置所有角色武将牌。",
  shjuyi: "聚义",
  shjuyi_info:
    "使命技，出牌阶段开始时，你可令所有其他角色依次选择是否交给你一张牌，选择是的角色回复1点体力或摸一张牌，且其可改为由你选择并执行，然后将势力变更为梁山。成功：出牌阶段结束时，若场上至少半数角色响应过〖聚义〗，你获得〖天魁〗。",
  shtiankui: "天魁",
  shtiankui_info:
    "主公技，锁定技，每轮开始时，场上所有角色按体力值大小降序排序，对应序号为“星位”（若相同则座次小者在前）。一名梁山势力角色的回合开始时，若其座位号不小于“星位”，其可视为使用无距离限制的雷【杀】；不大于，其与你各摸一张牌。",
  shluanji: "乱骑",
  shluanji_info:
    "锁定技，你的回合内，处于连环状态的角色非锁定技失效；本回合失去过牌的角色不能响应你使用的牌；装备区有牌的角色受到你造成的伤害+1。",
  shpozhen: "破阵",
  shpozhen_info:
    "出牌阶段限两次，你可将任意张基本牌当无距离与次数限制的雷【杀】使用。若这些牌包含：两种花色，此【杀】不可被响应；所有手牌，此【杀】伤害基数+1。",
  shchouni: "仇逆",
  shchouni_info:
    "限定技，回合开始时，若场上没有与你同阵营的其他角色，你可失去体力至1点，获得〖飞扬〗、〖跋扈〗并令你的摸牌数、出牌阶段使用【杀】限制次数、手牌上限均翻倍。若如此做，游戏进入鏖战至你死亡。",
  shgengzheng: "耿正",
  shgengzheng_info:
    "锁定技，你对攻击范围外的角色造成的伤害视为冰冻伤害；你对攻击范围内的角色造成伤害时，其本回合非锁定技失效。",
  goulianqiangfa: "钩镰",
  goulianqiangfa_info:
    "你的攻击范围+2。你使用【杀】指定目标后，你可弃置其装备区内一张牌，若为坐骑牌，此【杀】伤害+1。",
  shtianyou: "天佑",
  shtianyou_info:
    "锁定技，游戏开始时，你将【赛唐猊】置入你的装备区。当你失去装备区一张防具或宝物牌后，你可令一名角色获得〖钩镰〗。",
  shwushuang: "舞霜",
  shwushuang_info:
    "弃牌阶段结束时，若此阶段内有牌进入了弃牌堆，你可视为使用一张无距离限制的冰【杀】，且抵消此【杀】所需【闪】数为这些牌包含的花色数。",
  shchanjin: "缠锦",
  shchanjin_info:
    "你可将一张红色牌或锦囊牌当【铁索连环】使用。若均满足，因此横置的角色不能使用或打出与之花色相同的手牌至再次重置；因此重置的角色摸两张牌。",
  shbenjiu: "奔救",
  shbenjiu_info:
    "你攻击范围内的角色受到伤害时，你可选择一项：将所有手牌交给其，然后其回复1点体力；将此伤害转移给你，然后你与其各摸一张牌。背水：此后〖奔救〗可对其发动时须发动。",
  shyebing: "冶兵",
  shyebing_info: `出牌阶段限一次，你可将一张武器、防具或【铁索连环】移出游戏，令一名角色从游戏外获得一张${get.poptip("shyebing_faq")}中含有的武器或防具牌并装备之。`,
  shbazhen: "把诊",
  shbazhen_info:
    "你可将【杀】当【火攻】使用，然后弃置展示牌或你的一张手牌。若其为女性/以此法弃置了黑色牌，你/其回复1点体力。",
  shtongmai: "通脉",
  shtongmai_info:
    "你使用实体牌含【杀】的牌指定唯一目标时，可令目标摸一张牌，然后获得其一张牌。",
  shaiai: "皑皑",
  shaiai_info:
    "出牌阶段限一次，你可将一张梅花手牌视作【白银狮子】置入你的装备区。当此牌离开你的装备区时，你将之移出游戏并摸两张牌。",
  shhanhan: "酣酣",
  shhanhan_info:
    "锁定技，你造成或受到伤害后，伤害来源获得一张因〖皑皑〗除外的牌。",
  shshenxing: "神行",
  shshenxing2: "神行",
  shshenxing_info: `摸牌阶段结束时，你可将至多四张锦囊牌作为“甲马”置于任意名角色的武将牌上。一名有“甲马”的角色回合结束时，你可移去其两张“甲马”，令其执行一个拥有${get.poptip("new_zhixi")}的额外回合。`,
  shzoutan: "走探",
  shzoutan_info:
    "有角色因摸牌得到牌后，若你至其距离为1，你可观看这些牌，且你可展示并获得其中一张锦囊牌，然后本回合〖走探〗失效。",
  shjiama: "甲马",
  shzhiba: "豸霸",
  shzhiba_info:
    "锁定技，你攻击范围内每有一名角色，你的手牌上限和出【杀】次数上限便+1。你使用的牌无视防具且不能被你攻击范围内的角色响应。",
  shduofan: "夺幡",
  shduofan_info:
    "出牌阶段开始时，你可视为对任意名攻击范围外的角色使用一张【决斗】并摸等量牌。若你以此法指定了所有可选角色，你的攻击范围+1。",
  shgengjue: "耕掘",
  shgengjue_info:
    "①游戏第一轮，你可移动场上一张装备牌，视为使用一张你未使用过的基本牌；②第二轮，你可废除一个装备栏，视为使用一张弃牌堆中含有的基本牌；③第三轮及以后，你可将一张基本牌当你因①或②使用过的基本牌使用或打出，若均满足，你摸一张牌并令③项本回合失效。",
  shgengjue1: "耕掘①",
  shgengjue2: "耕掘②",
  shgengjue3: "耕掘③",
  shwoxuan: "斡旋",
  shwoxuan_info:
    "转换技，阳：其他角色出牌阶段结束时，其可交给你任意张牌，若不多于两张，不转换〖斡旋〗；阴：出牌阶段开始时，你可将任意张牌交给一名其他角色，令一名角色回复1点体力并复原武将牌，若不少于两张，不转换〖斡旋〗。",
  shbinhua: "鬓华",
  shbinhua_info: `游戏开始时，你可将一张牌置于武将牌上，你本局游戏视为拥有限该花色牌的${get.poptip("shjijiu")}。`,
  shjijiu: "急救",
  shjijiu_info: "你的回合外，你可将一张红色牌当做【桃】使用。",
  shxingshao: "行艄",
  shxingshao_info:
    "出牌阶段限一次，你可横置你与一名其他角色，然后再对一名其他角色造成1点雷电伤害，若这两名角色为同一角色，你获得其至多两张牌。",
  shjinghun: "鲸魂",
  shjinghun_info:
    "限定技，其他角色死亡后，其可令你摸两张牌并将其一张武将牌置为你的副将，然后你当前所有手牌均明置为无距离与次数限制的雷【杀】，称为“鲸魂”牌。当你失去所有“鲸魂”牌后，你移去副将。",
  shyinzi: "淫恣",
  shyinzi_info:
    "摸牌阶段，你可多摸三张牌，然后选择一项：弃置两张牌；将两张牌交给一名其他女性角色，然后其回复1点体力。",
  shxuanfeng: "旋风",
  shxuanfeng_info:
    "弃牌阶段结束时，你可弃置任意名角色共计两张牌或移动场上一张牌，然后此阶段失去牌最少的角色依次受到你造成的1点伤害。",
  shzhebang: "折棒",
  shzhebang_info:
    "出牌阶段限一次，你可弃置任意张【杀】并视为使用一张【决斗】，然后当此牌对目标造成伤害后，你摸两倍数量的牌。",
  shyijiao: "异角",
  shyijiao_info:
    "锁定技，你的手牌为奇数张时均视为无距离限制的【杀】；你使用的【杀】无视防具。",
  shtouchui: "头槌",
  shtouchui_info:
    "当你成为伤害类牌的目标后，你可弃置一张【杀】，对使用者造成1点伤害。",
  shfeixing: "飞星",
  shfeixing_info:
    "你每回合首次使用一种花色的牌指定目标后，若没有角色处于濒死状态，你可令你攻击范围内一名与你距离大于1的角色选择一项：打出一张与之花色相同的【杀】或【闪】；受到你造成的1点伤害。",
  shzhengxuan: "筝旋",
  shzhengxuan_info:
    "每回合限一次，你使用或打出【杀】或【闪】后可摸一张牌并选择一项：令你本轮的进攻距离+1；令你本轮的防御距离+1。",
  shjilang: "击浪",
  shjilang_info:
    "出牌阶段，你可与一名手牌比你少一张的角色交换手牌，然后你可对其造成1点雷电伤害。",
  shfanjiang: "翻江",
  shfanjiang_info:
    "结束阶段，你可将手牌摸至全场最多，然后选择一项：翻面；将手牌弃至全场最少。背水：翻面一名其他角色。",
  shpudou: "扑斗",
  shpudou_info: "锁定技，其他角色仅对你使用的黑色【杀】按【决斗】结算。",
  shdengfeng: "登锋",
  shdengfeng3: "登锋",
  shdengfeng_info:
    "摸牌阶段/出牌阶段/弃牌阶段开始时，你可跳过你下个回合的对应阶段，视为使用一张【决斗】。若如此做，你此阶段的额定摸牌数/额定出【杀】限制次数/手牌上限基数改为你的已损失体力值。",
  shqiujin: "虬劲",
  shqiujin_info:
    "出牌阶段，你可重铸X张花色不同的牌，然后令一名手牌数或体力值大于你的角色选择一项：交给你与重铸牌花色互补的牌各一张，然后你本回合〖虬劲〗失效；受到你造成的1点雷电伤害（X为你本回合发动〖虬劲〗的次数）。",
  shduanming: "断命",
  shduanming_info:
    "你可将一张黑色牌当无距离限制且可额外指定一名目标的雷【杀】使用，然后当此【杀】被抵消时，你可横置任意名目标。",
  shzangliu: "葬流",
  shzangliu_info:
    "限定技，出牌阶段，你可翻面并重置任意名座次连续的角色。若如此做，当这些角色受到伤害后，其须选择一项：弃置两张牌；失去1点体力。",
  shenyu: "恩予",
  shenyu_info:
    "其他角色的回合结束时，你可将任意张类型不同的牌交给该角色并令其摸等量牌。若多于一张，你摸一张牌或回复1点体力；多于两张，其执行一个额外回合，然后〖恩予〗改为蓄势技。",
  shyiduo: "义夺",
  shyiduo_info: `${get.poptip("rule_xushiSkill")}，出牌阶段，你可令一名成为过你〖恩予〗目标的角色视为使用一张【决斗】，然后当此【决斗】造成伤害后，你与受伤角色交换手牌。<br>积势：发动三次〖恩予〗。`,
  shshilun: "释论",
  shshilun_info:
    "准备阶段，你可令一名角色弃置任意张牌。然后其每满足下列一项，你便与其各摸一张牌：未造成过伤害；已损失体力值大于你；手牌数为全场最低；若皆不满足，你对其造成1点伤害。",
  shcaiyin: "菜荫",
  shcaiyin_info: `每年限一次，结束阶段，你可用所有手牌交换${get.poptip("rule_centralDisCards")}的所有牌。当你杀死一名角色后，你失去〖菜荫〗并获得${get.poptip("shjiepeng")}。`,
  //washCard: "洗牌",
  shhuaibi: "怀璧",
  shhuaibi_info: `锁定技，游戏开始时，你获得${get.poptip("shgoulianqiang")}与${get.poptip("shsaitangni")}并置入装备区。若你的武器栏有牌，你计算与其他角色距离时-1；若你的防具栏有牌，其他角色计算与你距离时+1。`,
  shguzhi: "孤志",
  shguzhi_info:
    "出牌阶段开始时，你可明置一张手牌。你可将一张暗置牌当明置的基本牌或普通锦囊牌使用，然后暗置一张手牌。你的明置手牌不计入手牌上限。",
  shantu: "黯途",
  shantu_info: `${get.poptip("rule_zhuanhuaji")}，锁定技，暗：你失去明置手牌后，你获得两张【影】；明：你失去所有【影】后，你摸三张牌并明置。转机：结束阶段，你进行判定，若判定结果为黑色，转换至暗；红色，转换至明。`,
  shguzhi_view: "孤志",
  shguzhi_view_backup: "孤志",
  shlieri: "烈日",
  shlieri_info:
    "出牌阶段开始时，你可展示所有手牌并重铸其中至多半数牌。若如此做，当你此阶段使用一张牌后，除你外所有目标角色需使用一张【酒】，否则失去1点体力。",
  shyuyin: "欲饮",
  shyuyin_info:
    "一名角色可将你的一张手牌当【酒】使用，若此牌不为红色，直到其回合结束，其不能再使用或打出牌。若如此做，当前回合结束时，若本回合内没有角色受到过伤害，你摸一张牌。",
  shyuyin2: "欲饮",
  shlvli: "膂力",
  shlvli_info:
    "锁定技，当你的拼点牌亮出后，你令之点数+X（X为你的体力值），然后失去1点体力。",
  shhanzhan: "酣战",
  shhanzhan_info:
    "出牌阶段，你可与体力值小于你/大于你的角色拼点，然后没赢的角色受到1点伤害/赢的角色摸两张牌。",
  shfengxuan: "锋旋",
  shfengxuan_info:
    "锁定技，你使用的【杀】无次数与目标数限制，且【杀】目标的上下家均可替该目标使用【闪】。",
  shyishi: "义释",
  shyishi_info:
    "你使用【杀】时，你可秘密令此【杀】结算的效果改为：目标回复1点体力。",
  shduiying: "对影",
  shduiying_info:
    "你使用的【杀】结算完成后，你可展示所有手牌并弃置其中与此【杀】颜色不同的所有牌，对此【杀】目标各造成1点伤害。",
  shhuisheng: "虺升",
  shhuisheng_info:
    "准备阶段或结束阶段，若你没有手牌，你可令一名角色摸两张牌，然后移动其装备区一张牌。",
  shhufen: "虎忿",
  shhufen_info:
    "转换技，锁定技，出牌阶段开始或结束时，你须获得场上一张装备牌，然后对，阳：攻击范围内；阴：攻击范围外一名角色造成1点伤害。",
  shjianbei: "兼备",
  shjianbei_info: `${get.poptip("rule_zhuanhuaji")}，锁定技，智：你视为拥有${get.poptip("jizhi")}；勇：你视为拥有${get.poptip("xiaoji")}。转机：智->勇，你使用黑色装备牌后；勇->智，你使用红色装备牌后。`,
  shzaomeng: "造艨",
  shzaomeng_info:
    "结束阶段，你可弃置一张装备牌并横置一至两名角色，因此横置的角色仅能因火焰伤害再次重置武将牌。",
  shsuizhen: "随征",
  shsuizhen2: "随征",
  shsuizhen3: "随征",
  shsuizhen_info: `${get.poptip("rule_sameboatSkill")}，锁定技，你可观看与你${get.poptip("rule_sameboat")}的其他角色手牌并经过同意使用该角色的手牌；你摸牌阶段多摸一张牌。`,
  shxufa: "蓄发",
  shxufa_info:
    "当你造成或受到伤害后，你可选择一项：弃置X张牌；对一名手牌数不小于你的角色造成1点伤害，然后将手牌摸至X（X为你本回合发动〖蓄发〗的次数）。你连续选择第一项后，你本轮造成的伤害+1、受到的伤害-1；连续选择第二项后，本轮〖蓄发〗失效。",
  shhaoyong: "豪勇",
  shhaoyong_info:
    "出牌阶段限一次，你可扣置任意张点数和不大于13的牌并选择一名可拼点角色，然后用以此法扣置的牌依次与该角色拼点。若其没赢，你摸X+1张牌；若你没赢，你弃置X张牌（X为你武将牌上以此法扣置的牌数）。",
  shshaqian: "杀千",
  shshaqian_info:
    "结束阶段，你可对一名本回合失去过字母牌的其他角色造成1点伤害。",
  shchaqing: "察情",
  shchaqing_info:
    " 每轮限一次，其他角色的准备阶段，你可选择与其各：失去1点体力/弃置两张手牌。若如此做，有角色本回合内弃置任意张牌/减少任意点体力后，你回复等量体力/摸等量牌。",
  //shjianyun: "蹇运",
  //shjianyun_info: "你成为【酒】的目标后，若你未处于濒死状态，你受到使用者造成的1点伤害。",
  shweiji: "伪缉",
  shweiji_info:
    "一名角色横置或翻面时，若你或该角色为当前回合角色，手牌数最多的角色可弃置至多两张手牌并令你摸等量牌，然后取消之。",
  shchongjia: "冲枷",
  //shchongjia_info: "每回合限一次，与你距离1以内的角色受到伤害后，你可以选择一项：摸一张牌并横置伤害来源或受伤角色；对伤害来源造成1点雷电伤害（若你已横置，则你可以改为2点并删去此项）。若伤害来源不为你，你可以额外选择一项；若受伤角色不为你，你可以重复执行一项。",
  shchongjia_info:
    "每回合限一次，与你距离1以内的角色受到伤害后，你可选择一项：摸一张牌并横置伤害来源或受伤角色；对伤害来源造成1点雷电伤害。若伤害来源不为你，你可额外选择一项；若受伤角色不为你，你可重复执行一项。",
  shqinghong: "倾洪",
  shqinghong_info:
    "准备阶段，你可弃置任意张牌并弃置任意名其他角色共计等量张牌，然后因此失去手牌区或装备区所有牌的角色各受到你造成的1点雷电伤害。",
  shjiaoqian: "蛟潜",
  shjiaoqian_info: `限定技，结束阶段，若你体力值为1，你可摸三张牌并隐匿。若如此做，你于你的回合内登场时，你自选势力并加1点体力上限，回复1点体力，然后获得${get.poptip("shtaian")}。`,
  shtaian: "泰安",
  shtaian_info: `主公技，出牌阶段每种花色各限一次，你可一张牌当${get.poptip("dongzhuxianji")}对与你势力相同的角色使用，然后若其不为你，你本回合的攻击范围与手牌上限皆+1。`,
  shlianzhu: "连珠",
  shlianzhu_info:
    "你可弃置一张红色牌，无效你攻击范围外角色对你使用的【杀】，或弃置一张黑色牌，无效你攻击范围内角色使用的【闪】。你一回合连续执行相同项后，你摸一张牌。",
  shjunjie: "郡杰",
  shjunjie_info:
    "锁定技，游戏开始时，你弃置任意张牌，然后获得如下等量项效果：摸牌阶段多摸一张牌；使用【杀】额外结算一次；手牌上限+2；攻击范围+1。",
  shchuanling: "穿岭",
  shchuanling_info:
    "你使用【杀】指定唯一目标后，你可移动你至其较短路径上角色场上一张牌，然后若该路径上角色场上均没有牌，此【杀】不可响应；另一路径上角色场上均有牌，此【杀】伤害+1。 ",
  shfushe: "伏射",
  shfushe_info:
    "每轮限一次，一名角色的准备阶段，你可将武将牌翻至背面朝上，视为使用一张无距离限制的刺【杀】。若如此做，本回合结束阶段，你翻面X次并摸X张牌（X为你本回合造成和受到过的伤害值）。",
  shzhuilie: "追猎",
  shzhuilie_info: `你可将一张【杀】或【闪】当${get.poptip("diaohulishan")}使用，然后你可对你攻击范围内所有角色使用一张【杀】，若此【杀】指定唯一目标，你获得其两张牌。`,
  shxuci: "蓄刺",
  shxuci_info:
    "准备阶段，你可获得你场上所有牌，然后这些牌本回合视为刺【杀】；结束阶段，你可摸一张牌，然后你可弃置一张手牌，移动场上一张装备牌。",
  shjuantu: "卷土",
  shjuantu_info: `每阶段限一次，你因弃置失去任意张牌后，你可令等量其他角色各摸或弃置一张牌，然后若${get.poptip("rule_centralDisCards")}包含四种花色，你分配其中三张牌。`,
  shjuxian: "聚贤",
  shjuxian_info: `其他角色回合开始时，你可将一张装备牌置入其装备区并摸一张牌，且若为武器牌/防具牌，其获得〖跋扈〗/${get.poptip("xiangle")}直到其下回合开始。`,
  shguiyin: "贵胤",
  shguiyin_info: `锁定技，若你宝物栏没有牌，你视为装备着${get.poptip("danshutiequan")}；你进入濒死状态时，废除宝物栏。`,
  shtalang: "踏浪",
  shtalang_info:
    "转换技，你可将一张不为本回合获得的牌当①【顺手牵羊】②【顺手牵羊】③【顺手牵羊】④将一张为本回合获得的牌当【出其不意】使用。周始：你翻面。",
  shanfu: "暗伏",
  shanfu_info:
    "其他角色的准备阶段，若你武将牌背面朝上且不在其攻击范围内，你可摸一张牌或无距离限制的使用一张目标包含其的牌。背水：其本回合对你使用牌无距离与次数限制。若你的武将牌背面朝上，其他角色计算与你距离时+1。",

  shzuoyao: "作妖",
  shzuoyao_info:
    "你可将【杀】/【闪】/【桃】当【无懈可击】/【无中生有】/【闪电】使用，且令本回合所有角色不能使用或打出实体牌包括【杀】/【闪】/【桃】的牌。",
  shfengqi: "风起",
  shfengqi_info:
    "准备阶段，你可使用一张牌并摸一张牌，然后若你有至少一个区域的牌数因此增加，你可移动场上一张牌，且可再次发动不摸牌的〖风起〗。",
  shyangsha: "扬沙",
  shyangsha_info:
    "隐匿技，锁定技，你登场时，视为使用一张【南蛮入侵】，然后获得弃牌堆的所有属性【杀】。此后，场上每有一种花色的牌，你的手牌上限便+1。",
  shzuojun: "佐军",
  shzuojun_info:
    "出牌或弃牌阶段开始时，你可将至多三张基本牌当指定等量角色的【杀】使用，此【杀】每造成1点伤害，你获得一张【影】。",
  shzhuying: "逐影",
  shzhuying_info:
    "觉醒技，准备阶段，若你手牌中有至少两张【影】，你展示所有手牌，获得〖马术〗和〖无双〗，且将〖佐军〗的“获得一张【影】”修改为“摸一张牌”。",
  shyoubing: "佑兵",
  shyoubing_info:
    "锁定技，回合开始时，你将已损失体力值分配入<>中。你的攻击范围+<>；你使用【杀】可额外指定<>名目标；你的摸牌阶段摸牌数+<>。",
  shzhuifeng: "追风",
  shzhuifeng_info:
    "出牌阶段，你可对一名攻击范围外的角色造成1点伤害，然后〖追风〗失效至你攻击范围内有角色使用【闪】，且失效期间你获得〖飞影〗。",
  shfeiying: "飞影",
  shfeiying_info: "锁定技，其他角色计算与你的距离时+1。",
  shjiaolan: "搅澜",
  shjiaolan_info:
    "回合开始时，你可观看牌堆底四张牌并正面朝上分配其中的基本牌（其余牌置入弃牌堆）。若如此做，本轮结束时，你对手牌中有因此获得的基本牌的角色各造成1点雷电伤害。",
  shzonglang: "纵浪",
  shzonglang_info:
    "锁定技，每轮开始时，你选择一个未选择过的合法座次，于对应次序执行额定回合，若为一号位，你加1点体力上限，失去〖纵浪〗。",
  shzonglang_phase: "纵浪",
  shnilin: "逆鳞",
  shnilin_info:
    "其他角色使用【杀】/【闪】结算完成后，你可将一张【闪】/【杀】当【决斗】使用。",
  shyingxi: "鹰袭",
  shyingxi_info:
    "每回合限一次，一名角色阶段结束时，若此阶段你获得或失去过牌，你可摸一张牌。若如此做，你可失去1点体力，展示牌堆底五张牌，无距离限制的使用其中所有【杀】且分配剩余基本牌。",
  shyingshi: "鹰视",
  shyingshi_info:
    "当你摸牌时，你可从牌堆两端任意摸牌，若均为同一端，则可观看另一端三张牌并可任意改变顺序。",
  shfengshou: "烽首",
  shfengshou1: "烽首",
  shfengshou2: "烽首",
  shfengshou_info:
    "锁定技，每轮开始时，你执行一个出牌阶段在最前面的回合。你造成过伤害的出牌阶段结束后，将本回合随后最近一个不为出牌阶段的阶段修改为出牌阶段。",
  shchimou: "嗤谋",
  shchimou_info:
    "锁定技，你的红色锦囊牌视为无距离限制的火【杀】；黑色锦囊牌视为无目标数限制的【决斗】。",
  shlaiwuying: "来无影",
  shlaiwuying_info:
    "你使用【杀】指定唯一目标后，或成为【杀】的唯一目标后，可摸一张牌并重铸目标一张牌，将此【杀】改为【决斗】。",
  shquwuzong: "去无踪",
  shquwuzong_info: `每名角色的结束阶段，若${get.poptip("rule_centralDisCards")}只缺少一种花色，你可使用一张牌，结算完成后，若${get.poptip("rule_centralDisCards")}花色数为四，你获得其中除此种花色外每种花色的牌各一张。`,
  shwujin: "武进",
  shwujin_info:
    "连招技（武器牌+伤害牌+伤害牌），摸三张牌，然后若你使用连招内伤害牌均造成了伤害，你获得连招内的武器技能。",
  shrenxia: "任侠",
  shrenxia_info:
    "每回合限一次，你或你攻击范围内的角色受到伤害后，你可以将手牌数调整至你的攻击范围，若你因此弃置了牌，本回合结束后，你使用弃牌堆一张武器牌或伤害牌。",
  shduwo: "渡我",
  shduwo_info: ``,
  shdingli: "鼎力",
  shdingli_info: "",
  shyingong: "引弓",
  shyingong_info:
    "出牌阶段每种花色限一次，你可重铸一张非基本牌或【杀】，令此阶段使用【杀】次数与攻击范围+1。因此进入你攻击范围的角色此阶段内不能响应你使用的牌。",
  shshenbi: "神臂",
  shshenbi_info:
    "锁定技，你使用【杀】指定唯一目标后，若场上所有其他角色均在你攻击范围内，此【杀】伤害基数+1。",
  shjianhen: "箭痕",
  shjianhen_info:
    "锁定技，你使用实体【杀】造成伤害后，或受到实体牌中包含【杀】的牌造成的伤害后，将这些【杀】置于武将牌上。",
  shfeihu: "飞虎",
  shfeihu_info: "出牌阶段，你可将武将牌上的<u>箭痕牌</u>当【决斗】使用。",
  shhutun: "虎吞",
  shhutun_info:
    "每轮每种花色各限一次，一名角色使用或打出【杀】后，你可获得之。",
  shguandi: "贯敌",
  shguandi_info:
    "若你装备区有武器牌，你使用与该武器花色相同的【杀】无次数限制，且造成伤害时，你可弃置装备区对应花色的武器牌，令伤害+1。",
  shnongwu: "弄武",
  shnongwu_info:
    "你可将最后一张手牌当伤害-1的【决斗】使用，且令你攻击范围内的至多三名角色依次选择一项：交给你两张牌，或令此【决斗】伤害+1。",
  shxiangma: "相马",
  shxiangma_info:
    "出牌阶段限一次，你可将弃牌堆点数最大的装备牌置于场上，然后弃置场上一张点数最小的牌。",
  shxiangma_backup: "相马",
  shshengxi: "生息",
  shshengxi_info:
    "一名角色失去装备区的一张牌后，你可令其本轮进攻距离+1或-1，若为坐骑牌，你摸两张牌；若所有角色因此脱离其攻击范围，你可令其回复1点体力。",
  shyiqing: "一清",
  shyiqing_info: `出牌阶段限一次，你可蓄谋手牌至一张。若如此做，直到你下回合开始，你失去最后一张手牌后，摸两张牌。`,
  shyouyun: "游云",
  shyouyun_info:
    "你可移动场上一张牌，视为使用一张普通锦囊牌。若不为本轮首次发动，则前者名称字数需比上次多，后者合法目标需比上次少（蓄谋牌的名称字数视为1）。",

  shjizhan: "疾斩",
  //shjizhan_sha: "疾斩",
  shjizhan_info: `出牌阶段，或你受到伤害后，你可重铸任意张【杀】或【闪】。若如此做，当前回合结束时，你可视为使用一张雷【杀】，且此牌造成伤害后将所有手牌与${get.poptip("rule_centralDisCards")}共三张【杀】与【闪】交换（不足则全交换）。`,
  shxiongqi: "雄起",
  shxiongqi_info:
    "你因〖疾斩〗使用的【杀】杀死一名角色后，此后你因此使用的【杀】无视距离且不可响应。",

  shyidan: "义胆",
  shyidan_info:
    "每轮每项限一次，你可：①明置一张【杀】；②弃置一张【闪】；③分配一张【酒】，并视为使用【桃】。每轮结束时，若你本轮造成过伤害，你可重新分配上述基本牌的位置。",
  //shyidan_info: "你可：①明置一张【杀】；②弃置一张【闪】；③分配一张【酒】，并视为使用【桃】。每轮结束时，若你本轮造成过伤害，你可重新分配上述基本牌的位置。",
  shguao: "孤鏖",
  shguao_info: `限定技，回合结束后，你可失去 1 点体力，摸三张牌并执行一个拥有${get.poptip("paoxiao")}的额外回合。若如此做，当你于此回合内杀死一名角色后，你重置〖孤鏖〗。`,
  shpaoxiao: "咆哮",
  shpaoxiao_info: "锁定技，出牌阶段，你使用【杀】没有数量限制。",

  shwuyao: "武耀",
  shwuyao_info:
    "出牌阶段开始时，你可展示一张红色手牌并摸三张牌，然后令一名其他角色选择一项：与你拼点；视为对你使用【决斗】。然后没赢的角色展示所有手牌。",
  shweizhan: "威斩",
  shweizhan_info: `你一轮内展示过的牌可当【杀】使用或打出，若为红色，则无距离限制；展示过至少两次，则伤害+1。${get.poptip("rule_centralDisCards")}每有一张【闪】，你出牌阶段出【杀】次数+1。`,

  shshuaza: "耍杂",
  shshuaza_info:
    "出牌阶段限一次，你可以视为使用一张【无中生有】，然后令所有攻击范围内角色依次选择一项：令你摸一张牌；视为对你使用一张【过河拆桥】。",
  shshouzi: "守锱",
  shshouzi_info:
    "你因弃置失去任意张牌后，你可以摸两倍数量的牌，然后防止你下X次摸牌（X为本次摸牌数一半，向下取整）。",

  shduqiu: "渡泅",
  shduqiu_info: `出牌阶段开始时或你受到伤害后，你可将你武将区此牌当点数为A、花色为♣的雷【杀】置于牌堆顶首张牌之下。你使用牌时，你可将武将牌从牌堆下移一位并摸X张牌（X为你本回合当前连续使用的同色牌数-1，至多为3)。`,
  shfuyuan: "伏渊",
  shfuyuan_info: `锁定技，此武将牌在牌堆时，仅以你为目标的牌无效；此武将牌被角色获得或进入弃牌堆时，你展示并放回武将区，对一名角色造成1点雷电伤害，若不为当前回合角色，你失去1点体力。`,
  shyueyong: "跃涌",
  shyueyong_info: `限定技，准备阶段，若你或主公体力值为1，你可以摸两张牌并令〖渡泅〗中的“顶”改为“底”，“下”改为“上”。若如此做，若你于下次杀死角色前受到了伤害，你移除副将或死亡。`,
  shyueyong2: "跃涌",
  //其他
  shjixian: "嫉贤",
  shjixian_info:
    "出牌阶段限两次，你可弃置一名手牌数大于你的角色两张牌，然后若其手牌数仍大于你，你摸一张牌；或对体力值大于你的角色造成1点伤害，然后若其体力值仍大于你，你回复1点体力。你对同一名角色连续发动〖嫉贤〗后，其可视为对你使用一张【杀】。",
  shxiaxin: "狭心",
  shxiaxin_info:
    "锁定技，若你攻击范围内有体力值和手牌数均大于你的角色，你的手牌上限-1。",
  shchizhu: "斥逐",
  shchizhu_info:
    "主公技，每回合限一次，你使用基本牌或普通锦囊牌指定目标时，或成为基本牌或普通锦囊牌的目标时，你可令一名梁山势力角色成为此牌额外目标，若此牌为伤害牌，你摸两张牌。",
  shxiaxing: "侠行",
  shxiaxing_info:
    "你不因摸牌获得牌后，你可令当前回合角色摸一张牌，若其在你的攻击范围内，你摸一张牌；若其不为你，其本回合手牌上限+1。",
  shyijie: "义结",
  shyijie_info: `出牌阶段限X次，你可将一张基本牌当${get.poptip("tuixinzhifu")}对攻击范围内的角色使用，且你可多交出一张牌，然后令目标获得〖义结〗（X为场上拥有〖义结〗的角色数）。`,
  shxueshi: "血誓",
  shxueshi_info:
    "主公技，锁定技，你的/其他梁山势力角色的攻击范围基数为你的体力值/已损失体力值且至少为1。若你的体力值为1，所有角色的〖义结〗改为转化无次数限制的【杀】。",
  shzhuanfu: "篆符",
  shzhuanfu_info:
    "限定技，出牌阶段，你可为手牌中的一张基本牌或普通锦囊牌添加或修改应变标签；或为手牌中的一张装备牌添加或取消赠物标签。若如此做，你可将一张手牌交给其他角色，然后将手牌摸至四张。",
  shchisheng: "驰声",
  shchisheng_info:
    "其他角色的出牌阶段限一次，其可将一张手牌交给你，然后你可对此牌执行〖篆符〗效果并交给其；你的出牌阶段限一次，你可弃置X张牌并重置〖篆符〗（X为场上未对你发动过〖驰声〗的角色数）。",
  shdiaoman: "刁蛮",
  shdiaoman1: "刁蛮",
  shdiaoman2: "刁蛮",
  shdiaoman3: "刁蛮",
  shdiaoman_info:
    "每回合各限一次，你使用基本牌时，可明置一名其他角色一张手牌；不因摸牌获得锦囊牌后，可展示之并分配1点伤害；失去装备区的牌后，可获得场上其他角色区域内一张对你可见的牌。",
  shxindang: "心荡",
  shxindangx: "心荡",
  shxindang_info:
    "每轮限X次，你受到伤害后/男性角色造成伤害后，男性角色/你可与另一方交换一张牌，因此获得红桃牌的角色视为使用【桃】或【酒】（X为你空置装备栏数）。",
  shxiongju: "雄据",
  shxiongju_info:
    "出牌阶段限一次，你可令你攻击范围内至多三名角色各弃置一张牌，然后你视为对所有未弃置【杀】的角色依次使用一张【决斗】。你因此【决斗】进入濒死状态时，你令〖雄据〗可选角色数-1，然后将体力回复至1点。",
  shduguo: "蠹国",
  shduguo_info:
    "场上的装备牌进入弃牌堆后，你可将这些装备牌移出游戏，然后摸一张牌。",
  shshiting: "噬廷",
  shshiting_info:
    "你可将一张黑桃牌当【无中生有】对一名其他角色使用，然后若其手牌数大于你，你对其造成1点伤害，再然后，若其体力值也大于你，你弃置其两张牌。",
  shqinye: "侵野",
  shqinye2: "侵野",
  shqinye_info:
    "每轮开始时，所有其他角色需交给你一张基本牌，否则此轮内对其生效的所有锦囊牌的效果均改为【杀】。",
  shjianwu: "剑舞",
  shjianwu_info:
    "连招技，出牌阶段，你可：①打出一张【杀】；②重铸一张【闪】。然后此阶段你可多出一张【杀】。<br>①+锦囊牌：锦囊牌可额外指定一名目标；<br>②+锦囊牌：回复1点体力；<br>锦囊牌+②+①：视为使用一张无视距离次数限制的雷刺【杀】。",
  shcheying: "掣影",
  shcheying_info:
    "锁定技，你使用牌时，若你本回合使用的上一张牌为锦囊牌，此牌不可响应。你成为牌的目标时，若此牌使用者本回合使用的上一张牌不为锦囊牌，你摸一张牌。",
  shqizhen: "奇阵",
  shqizhen_info:
    "转换技，你可将任意张点数和为当前序号倍数的牌置于牌堆两端，视为使用一张：①【杀】；②【闪】；③【无懈可击】；④【决斗】。且每转换完一轮，便在末尾添加一个你未持有的基本牌或普通锦囊牌转换项；游戏每过一轮，便可重新分配转换项的次序。",
  shqinyu: "寝玉",
  shqinyu_info:
    "出牌阶段，你可将一张黑色【杀】当【偷梁换柱】使用。若目标为女性，则可经其同意无视交换牌数限制；为男性，你对其造成1点伤害，本回合〖寝玉〗失效。",
  shshibi: "势庇",
  shshibi_info:
    "结束阶段，或你受到伤害后，你可交给体力值为全场最大的其他角色一张牌，然后其可令你回复1点体力或从弃牌堆获得一张【杀】。",
  shxuxun: "虚勋",
  shxuxun_info:
    "其他角色死亡后，你可摸两张牌并明置，这些牌不计入你的手牌上限，然后你获得1点护甲。当你因受到伤害而失去护甲后，你弃置所有牌。",
  shxiaojue: "枭绝",
  shxiaojue2: "枭绝",
  shxiaojue_info:
    "每回合限一次，其他角色脱离濒死状态时，你可与当前回合角色议事，若议事结果为黑/红，你对该角色/当前回合角色造成1点伤害；若无结果，你下次造成伤害值+1。",
  shbitang: "蔽堂",
  shbitang_info: `锁定技，你获得阵亡角色的身份牌。你可移去一张此法获得的：“反贼”身份牌，发动${get.poptip("zhiheng")}，“忠臣”身份牌，发动${get.poptip("olzaowang")}，“内奸”身份牌，发动${get.poptip("luanwu")}。`,
  shchijun: "叱军",
  shchijun_info:
    "你使用【杀】指定唯一目标后，或成为【杀】的唯一目标后，你可令此【杀】一个攻击路径上的所有角色选择交给此【杀】使用者或目标一张牌，然后若此【杀】造成了伤害，你令其中未交给你牌的角色各弃置两张牌。",
  shbengluan: "崩峦",
  shbengluan_info:
    "锁定技，你始终视为装备着【贯石斧】。若你的体力值或手牌数为全场最多，你造成或受到【杀】的伤害+1。",
  shyaoyan: "妖焱",
  shyaoyan_info: `出牌阶段限一次，你可令至多三名其他角色与你各获得一张红桃${get.poptip("du")}，视为对这些角色使用一张【火攻】。`,
  shzoumo: "走魔",
  shzoumo_info:
    "出牌阶段，你可亮出牌堆底至多六张牌。若均为红色，你获得之；否则，你令包含你在内的X名角色各受到来源为你的1点雷电伤害，并令〖走魔〗本回合失效（X为其中的黑色牌数)。",
  shyufen: "欲焚",
  shyufen_info:
    "锁定技，出牌阶段开始时，你视为使用三张【火攻】，均结算完成后，所有目标依次选择一项：弃置两张展示牌；将一张展示牌交给你；重铸三张展示牌，对你造成1点伤害。",
  shyanzi: "艳姿",
  shyanzi_global: "艳姿",
  shyanzi_info:
    "锁定技，你不能弃置不因摸牌获得的红色手牌，且明置并视为所有其他角色均可经你同意使用的【桃】；若你本轮受到过伤害，则可不经你同意。",

  shjianlai: "剑来",
  shjianlai_info: `锁定技，游戏开始时，或${get.poptip("shxuantianhunyuanjian")}进入弃牌堆后，你获得【玄天混元剑】。你使用【杀】或锦囊牌结算完成后，你可移动场上的【玄天混元剑】（可替换原装备）。`,
  shzhaxi: "诈袭",
  shzhaxi_info:
    "每轮限一次，你成为【杀】的目标后，可秘密选择一项：①你使用的下张【杀】伤害+1，直到其他角色对你使用【杀】；②下张以你为目标的【杀】无效且你获得之，直到你使用【杀】。",
  shpifeng: "劈风",
  shpifeng_info:
    "出牌阶段限一次，你可弃置至多三名相邻角色各一张手牌并摸等量牌，然后你可无次数限制的使用因此弃置的【杀】，且有角色因此失去【闪】后，你使用的【杀】不能被响应直到回合结束。",
  shjuguan: "据关",
  shjuguan_info:
    "出牌阶段限X次，你可将牌堆顶两张牌当【万箭齐发】使用，然后将两张牌置于牌堆顶（X为你装备区牌数，至少为1）。",
  shyinyu: "饮羽",
  shyinyu_info:
    "你使用牌对其他角色造成伤害时，可弃置该角色区域内一张牌，然后若此牌与造成伤害的牌颜色相同，你获得此牌。",

  shdechong: "得宠",
  shdechong_info:
    "每轮开始时，手牌数唯一最多，体力值唯一最大，装备区牌数唯一最多的角色各可选择令你：摸两张牌；回复1点体力；移动场上一张牌。",
  shzenzhong: "谮忠",
  shzenzhong_info:
    "你使用牌指定其他角色为唯一目标后，可令其获得一张【影】；其他角色失去【影】后，你可弃置其两张牌。",
  shyingdang: "营党",
  shyingdang_use: "营党",
  shyingdang_info:
    "限定技，出牌阶段，你可横置包含你在内的至多四名角色，这些角色各回复1点体力，且可互相使用对方的手牌直到你或其重置。",

  shwuyin: "雾隐",
  shwuyin_info: "结束阶段，你可弃置所有手牌，令至多等量角色隐匿。",
  shfulong: "缚龙",
  shfulong_info: `出牌阶段限一次，你可从牌堆${get.poptip("rule_search")}一张黑色牌，然后将检索途中亮出的任意张红色牌依次当可额外指定至多X名角色的${get.poptip("sadouchengbingx")}、【铁索连环】、${get.poptip("shuiyanqijunx")}使用（X为对应实体牌数量-1）。`,
  shyishen: "役神",
  shyishen_info: `隐匿技，你登场时，可将一张${get.poptip("shjinjiashenren")}置入一名角色的装备区。`,
  shjuluan: "举乱",
  shjuluan_info: `${get.poptip("rule_xushiSkill")}，出牌阶段，你可以对至多两名角色各造成1点伤害/弃置至多两名角色共三张牌，然后令所有体力值/手牌数与你相同的角色各视为使用一张【杀】。积势：造成五次伤害。`,
  //shlietu: "裂土",
  //shlietu_info:`限定技，准备阶段，若你体力值为1，或当你进入濒死状态时，你可以将剩余牌堆置入弃牌堆，若其中没有【桃】，你回复所有体力。`,
  shgemang: "割莽",
  shgemang_info:
    "主公技，一名角色的回合内，当一次至少两张牌进入弃牌堆后，你可以获得其中一张。然后若该角色势力为群/晉，你〖举乱〗积势进度+1/将进入弃牌堆的其余牌分配给其他角色。",

  shsihu: "伺虎",
  shsihu2: "伺虎",
  shsihu_info:
    "晉势力技，出牌阶段开始时，你可以令一名角色摸至多三张牌，令其等量轮内受到【杀】的伤害+1；若其在加伤效果生效期间死亡，你变更势力至梁。",
  shmengyuan: "梦缘",
  shmengyuan2: "梦缘",
  shmengyuan_info: `准备阶段，你可以选择一项：视为使用一张无距离限制的【杀】；回复1点体力。若如此做，结束阶段，本回合被你使用牌指定最多次的角色依次执行你未选择项（若你的势力为梁，则改为由你选择其是否执行其中一项）。`,

  shtujiang: "图疆",
  shtujiang_info:
    "准备阶段，你可使用一张武器牌，然后因此进入你攻击范围内的所有角色依次选择：无距离限制的对你使用一张【杀】；令你摸一张牌，然后将势力变更为辽。",
  shlangsi: "狼肆",
  shlangsi_info:
    "出牌阶段，你可将任意张点数和为K的牌当可额外指定一名攻击范围内角色的【决斗】使用，若你因此对目标造成伤害，你获得该角色装备区一张牌。",
  shhaoye: "嗥野",
  shhaoye_info:
    "主公技，你的出牌阶段开始时，所有辽势力角色可依次使用一张牌。结束阶段，若场上所有角色势力均为辽，你所在阵营胜利。",
  shjiaojiao: "皎皎",
  shjiaojiao_info:
    "出牌阶段限一次，你可明置一张手牌，弃置其余暗置牌，然后摸等量牌。若你的手牌均明置，其他角色的手牌对你可见。",
  shhuisu: "麾素",
  shhuisu_info: `限定技，准备阶段，你可选择至多三名女性角色，这些角色各从游戏外将一张${get.poptip("yinyueqiang")}和【白银狮子】置入装备区，且获得${get.poptip("shyinzhen")}。`,
  shyinzhen: "银阵",
  shyinzhen_info:
    "每轮每项各限一次，你可将场上角色一张对你可见的牌当【杀】或【闪】使用或打出。若如此做，其摸一张牌。",

  shyingtian: "应天",
  shyingtian_info:
    "限定技，一轮开始时，若游戏轮数大于你所属势力存活角色数，你可从游戏外为你所属势力分配三张牌名不同的模式外锦囊牌（仅你所属势力可使用，且参与洗牌）。",
  shxingju: "星聚",
  shxingju_info: "一名角色死亡后，你可令另一名角色变更势力至群或与你相同。",
  shdianzhen: "点阵",
  shdianzhen_info: `出牌阶段限一次，你可令一名你所属势力角色从牌堆${get.poptip("rule_search")}一张【杀】，且你/其各可使用一张途中亮出的锦囊牌/装备牌。`,
  shhuitian: "回天",
  shhuitian_info:
    "准备阶段，若<u>应天牌</u>均在弃牌堆，你可分配其中一张<u>应天牌</u>，然后洗牌并令〖点阵〗可发动次数+1。",
  shjieyuan: "结缘",
  shjieyuan_info:
    "准备阶段，你可将一张装备牌置入一名男性角色的装备区并摸两张牌，然后其可弃置装备区所有牌，若其未如此做，你可与其交换手牌。",
  shqiangfu: "戕夫",
  shqiangfu_info:
    "限定技，结束阶段，你可将一名男性角色装备区所有牌当【杀】对其使用，此【杀】伤害基数为转化牌数。",

  shguzhai: "固寨",
  shguzhaix: "固寨",
  shguzhai_info: `你每回合首次造成/受到伤害后，摸一张牌，然后从弃牌堆获得一张【杀】/【闪】。准备阶段，你可将【杀】和【闪】各一张当${get.poptip("gz_guguoanbang")}使用。你因此弃置的装备牌改为置入空置装备栏，每有一张不能如此做，你获得其他角色一张牌。`,
  shfangyin: "芳吟",
  shfangyin_info:
    "每局每种花色组合限一次，出牌阶段，你可：明置/暗置至多三张花色不同的手牌，视为使用一张其中包含的，基本牌/普通锦囊牌。",
  shwanmeng: "绾盟",
  shwanmeng_info:
    "弃牌阶段结束时，你可令一名座次不大于你和不小于你的角色各摸一张牌，且其中座次小于你的角色可令另一方回复或失去1点体力。",
  shquanfu: "权腐",
  shquanfu_info: `锁定技，你的回合内，黑色【杀】/武器牌/防具牌进入弃牌堆后，将之替换为同花色点数的${get.poptip("du")}/${get.poptip("zheji")}/${get.poptip("nvzhuang")}随机置于牌堆前三张，然后你摸一张牌。`,
  shhaimou: "骇谋",
  shhaimou_info:
    "出牌阶段各限一次，你可以将一张黑色牌当【借刀杀人】、【过河拆桥】或【无中生有】使用。",
  shhuijin: "挥金",
  shhuijin_info:
    "你可以弃置装备区一张牌，视为使用任意一张基本牌，然后令攻击范围外所有其他角色各摸一张牌。",
  shxuanhe: "喧和",
  shxuanhe_info:
    "锁定技，每轮限一次，其他角色对你使用的【杀】改为【兵临城下】。结算完成后，你可获得以此法亮出的非基本牌，令〖喧和〗视为未发动过。",
  shfengheng: "丰亨",
  shfengheng_info: "主公技，锁定技，你的回合内，宋势力角色的【杀】视为【桃】。",
  //模板将
  shmuban: "模板",
  shmuban_info:
    "游戏开始时，你将体力上限和体力值调整为X，将额定摸牌数调整为Y（X，Y为任意正整数）。",
};
export default translate;
